9/data/attachments/9ead2cc48f533a5e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_e14a244b-93c0-48b8-8d81-c113e96e4042</nif:username>
            <nif:friendToBeAdded>Darren_nor_Friend_20554_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>